Revit 2027 API
CategoryNameMap Methods
The CategoryNameMap type exposes the following members.
Methods
Name | Description
Clear | Removes every category from the map, rendering it empty.
Contains | Tests for the existence of a category with that name within the map.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Erase | Removes a category with the specified name from the map.
ForwardIterator | Retrieve a forward moving iterator to the map.
GetEnumerator | Retrieve a forward moving iterator to the map.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert | Insert the specified category with the specified name into the map.
ReverseIterator | Retrieve a backward moving iterator to the map.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
CategoryNameMap Class
Autodesk.Revit.DB Namespace